Revit 2027 API
ExportFontKey(ExportFontKey) Constructor
 Constructs a new copy of the input ExportFontKey object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportFontKey(
	ExportFontKey other
)
Public Sub New (
	other As ExportFontKey
)
public:
ExportFontKey(
	ExportFontKey^ other
)
new :
        other : ExportFontKey -> ExportFontKey
Parameters
other ExportFontKey
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportFontKey Class
ExportFontKey Overload
Autodesk.Revit.DB Namespace